package gmail.jaydenkhr.review;

public class Practice_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        //**복습
		=>프로젝트 이름은 상관없지만 클래스 이름은 Main번호 로 하세요
				1.프로젝트를 만들어서 Hello World를 출력하기

				2.이름, 나이, 키, 몸무게를 변수에 저장하고 출력하기(변수)

				3.앞의 프로그램에서 몸무게를 키의 제곱(BMI 지수)으로 나누어서 출력(연산자)

				4.위에서 나온 결과를 소수 2째 자리에서 반올림해서 1째자리까지만 출력(형변환)

				5.정수 1개를 저장하고  윤년인지 판별(연산자)
				윤년이 되는 조건
				1)4의 배수이고 100의 배수는 아닌 경우
				2)400의 배수인 경우
				=>둘 중 하나만 만족하면 윤년입니다.

				6.3번의 결과로 나온 숫자 23을 넘어가면 과체중 그렇지 않으면 정상이라고 출력(if)

				7.3번의 결과가 18.5 보다 작으면 저체중 18.5 ~ 23 사이이면 정상 23을 넘고 25 이하이면 과체중 25를 초과하면 비만 이라고 출력(if)

				8.data0 부터 data9까지를 출력하기 - 출력하는 문장은 한 번만 나오기
				=>while, do~while, for 아무거나 사용

				=>이거 되면 1부터 100까지 의 합계를 구해보세요

				9. 아래 모양 출력해보기 - 반복문을 중첩
				System.out.print("*"), System.out.print("\n"), System.out.print(" ") 세 가지만 사용하기
				*****
				****
				***
				**
				*

				위의 것이 되면 아래 것을 하고 안되면 다음으로 패스
				  *
				 **
				***
				 **
				  *

				  1
				 23
				456
				 78
				  9

				10.이름 3개와 점수 3개를 배열로 만들어서 전부 출력하기

				11.가장 높은 점수를 출력

				12.가장 높은 점수를 받은 학생의 이름을 출력


				**간단한 알고리즘 문제
				1.2부터 1000까지 소수의 개수
				=>소수는 2부터 자신의 절반이 되는 숫자까지 나누어서 한 번도 나누어 떨어지지 않으면 소수

				2.2부터 1000까지 완전수의 개수 - 3
				완전수는 자기 자신을 제외한 모든 약수의 합이 자기 자신과 일치하는 수

				6은 완전수
				6 - 1, 2, 3, 6 : 1 + 2 + 3 = 6

	}

}
